Updated architecture diagram
